
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        9 |           7 |            9 |
## Affected resources by action

|  Action  | Resources                                                                       |
|:--------:|:--------------------------------------------------------------------------------|
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`                    |
|    🟡    | `module.actions-runner.aws_autoscaling_policy.scale_out`                        |
|    🟡    | `module.actions-runner.aws_launch_template.actions-runner`                      |
|    🟡    | `module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions` |
|    🟡    | `module.actions-runner.module.deregistration.aws_lambda_function.lambda`        |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`         |
|    🟡    | `module.actions-runner.module.registration.aws_lambda_function.main`            |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 60 -> 0
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
        # (30 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-08b47595a3bdafaf1"
            name    = "actions-runner-20250505203133108100000007"
          ~ version = "3" -> (known after apply)
        }

      ~ warm_pool {
          ~ max_group_prepared_capacity = 2 -> 1
            # (2 unchanged attributes hidden)

          ~ instance_reuse_policy {
              ~ reuse_on_scale_in = true -> false
            }
        }

        # (12 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be updated in-place
  ~ resource "aws_autoscaling_policy" "scale_out" {
      ~ cooldown                  = 180 -> 60
        id                        = "scale-out-idle-runners"
        name                      = "scale-out-idle-runners"
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-08b47595a3bdafaf1"
      ~ latest_version                       = 3 -> (known after apply)
        name                                 = "actions-runner-20250505203133108100000007"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHZGw0ZkFCRUFDc2E1ZnhWWDRWZU1XaEZRakdKQ01JNjF1d1BaWTlUbktKNHYza3IrMDVXSnZlcERxVgogICAgICAgIGpqWUxlSlEycHowVnBQajFvTnpEaWRNUUNxRW1vbzZuNlNtMEJ0eDl2UkNUa29pd3JteGhRM2ptTEwwK0VyeVMKICAgICAgICB5Qy9rakZQN2VhWjgzQXl6cG1VYyt1ZkcvUVN4RjBUYXJnUCtDU2tBNEFZSXMrREJwVkdiT1FJNFpSampsWHN6CiAgICAgICAgcTFMa2Q0NE9oZlk0RUcyaFBwTGNsblJ1YkJFYzB1OWRNRERuNFJidGpydTdscnkzUm9ML1gwTjM5RjA3SVlYOQogICAgICAgIEZ6c1gvYVdkVlcwTkdFRnBsM3ZjSmt3cTBuQ3dZTE1UT2tpNXMrYW1xVVhmeWQrdUNUYzQ0LzBOU0d5OW9iclQKICAgICAgICBHQU95STVzcE9VU2FncG55WTFiK3Y4UVF5VExsMzJsUWt5aWZMQUtneEo0UjJZM1d3UDZLTjljYnlGQXBCeEtHCiAgICAgICAgNFpwdXU5TGpwVVdpeStzb0tGM242T1R1RW1GMUpQaXRNNHV0Z2l3a2l1cTF4SFlMWGsvcEpEMGVOS0xUanJMMgogICAgICAgIDg2VVJYc0prT00vSVpydm82dXZ1MkFMVjhvMm1qbUlyajd2UzArUzZEZ2hGcEZGOU5YVjQrY3lXelJnV2hkQzcKICAgICAgICBCWnluTnRIb2c0M2RRQnNSaXVUWkJDV0lvUWtjUU5FeTVHT24vRHdqSWdJT21aSy9UaW9nNzU5NkFxaDVlS001CiAgICAgICAgU2F0ekJDUVNVenNFYVl4YlEwNU9OMkdxMzBOd1ludHlHdDZNamdjcWNlanprWlBHSzR6WFpSL2p3N1dQQTNHKwogICAgICAgIElQRzlNRTM3Y3BZNGk1Q2ZxcVYzbmpjeXJIY01TSW03aExWZVZxQU5vb1J1NjlXYk1CRjRrQVhuV1FBUkFRQUIKICAgICAgICB0R05KYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRTl5CiAgICAgICAgWVdOMWJHRnlJSEpsY0c5emFYUnZjbmtwSUR4d1lXTnJZV2RsY2kxdmNtRmpkV3hoY2tCcGJtWnlZV2h2ZFhObAogICAgICAgIExtTnZiVDZKQWxjRUV3RUtBRUVXSVFROVJHaUZuZ2JReHU1VVhTTmhjTkRiK3ZicDhnVUNaMlhoOEFJYkF3VUoKICAgICAgICBBOEpuQUFVTENRZ0hBZ0lpQWdZVkNna0lDd0lFRmdJREFRSWVCd0lYZ0FBS0NSQmhjTkRiK3ZicDhtbGVELzBkCiAgICAgICAgdjZDeklqMHJVeW1YUjZoQjVNWWlFSCtBbG1jcEVITyswQ3dvU3lGQzRlN3dkczFJcTBUVW9jTXl6WWxVUjhzQgogICAgICAgIGEreTJLTUd2bE5aQmVuSUtvcjAwNit6ZXdET21aWmJzOEt6YXZHQy9kTDlybU9uSTNiK1lkamFoUC95dm9rcHMKICAgICAgICAwM0kzSHNPRjlJaE9LdjZTbWczZ0QrSzFnRFUxVlFTWGRjZ2l5WDMyZFNaaG45WVJnUzhCcDUxSERNNHZzZmEzCiAgICAgICAgb2hvN0FLT3V5ZWx5V1VpNml5ZTF2L3d3Vjg5dE8rZkhSZzBGZUdBNWc4WnRYRFcyOUNPUDRnZy94OVhiRlVpNgogICAgICAgIEdGeUs2RVlGdm5zZHp2elRWN0pYeHRnMStQa2xveEpWRFJBZm5PUUdCTlh4TGRjM05jaTIwd09Ia2NHZEZJNnMKICAgICAgICBXN0tIMFZhOXh3c1QreHlRQTY1dm0xS1l6R0ordHN5ZTE5M1o0enZpM0pFbklkNFpZVU1aWEM2cTlnZWFLRktsCiAgICAgICAgRGx6dEZWWDUyUENHeGs1MlloSlB3WWNiOEpFRzNweE80eHdtRU9rOVRwTnRsVk1DZVgzZWFGYk5SVDJwWXJYYQogICAgICAgIEREL2ZCT2ZPRis1S3MxM0RBL3pKbnFwSHprbVNuNWdLOFdvR3U3UXUxZnpLNzJMY1RxYi82SnllSW04UlNydUUKICAgICAgICBiems2V0tYalB0eVhyczRWUStkMlhyOHk4Yk5nR3JCWDNUdVlhaVR2L05ka0hlaERvcXZzb0J1czQ4OS9DVVlaCiAgICAgICAgbU52MEt6c3pINWx6UHl2aTlyaURVUVJFZjNpcXhsLzVZMmFhTStWZHhoWGVmN3pJbzhpdDllcnZVMU5qaExzdAogICAgICAgIGh5MG9zbGxuWEg1TnZia1NZSEw3ZEV2N0NYVlhIb0JIUjFhcHJNdzJpYmtDRFFSblplSHdBUkFBMzA4aHRvMzAKICAgICAgICBuTEwwYy83NUU5YlFSTUJFOGFVaDdzd3JiUGo0bWlXeEhsemJXZFRzVjE3UDhEUFhuSlo2ZXE4VlVqcDYyWEh5CiAgICAgICAgS3J4YksvZTVXYWZoTWVuQlhDeWcxZVNkbjduMHI5bmIwRzlOS3hRNU84NlI1cFlaVmhERElIK3pNRnI2Y3BiMwogICAgICAgIEpSOWhsaEhPV3c5bktOU3VhMFRTL2FoS25DUWV3eDJ2MmNseERPaEc5QnN4ZlArT1l5a2tUSEx2QlZGbjh4S0oKICAgICAgICBRclpidGtuUE9BZDBxYUsxampuZ1JpYUpOWHlWWkJEVkFmUFhZYU5yS09ya3FCd1RZakdIR1lHdTNZUXdwNThOCiAgICAgICAgSjM5QjFPeXQ4emM3aFFublFLd1hRZ2ZFaE9uTFpGbDhhSkRBb2pQa0JlcHduc0tQTVo5RnVrQXQ5RHBab1VYdQogICAgICAgIDVtT2QzZFEzZDFKQTRvVXZTS1Z1TWtXWnc0ZXRPbDlDbHplSnhZV3ZsRGM4eFBHc0k5QU9xZmdJYXFDWmpFOXUKICAgICAgICAvb3kzeExEcjkrbjlmNEV5YXpraXhQTWNtL29Pd3RrUmZ4WjlKYU5TVFJ5S1JwZFRPZDJ6T21nNFA5TUVabm5kCiAgICAgICAgNkozSDFENnFmYkVJYUc3SGt2RVc3YzFuTHBXMnhyTjZXWjZreTZGd1ppZDAzajlOMVg3YTV3WkpaaVQ0Z1l1dAogICAgICAgIFN6SXo0UlMyamJrWmd5NGdCV2krc0lmZDliVGtWRzcvNVNCam4wV0E5NWtJS3I1MjVXVlgrS3dtNXFrYU5IZE4KICAgICAgICBnT3FLL3BkS1gzUTNOS1hURG1CV3VPcnRoSEk1TUxHYVBLd3hDVnhaSTI3MGpvVXhQbjJmYUh5emRQNWNiTm9mCiAgICAgICAgZGlVd25XVVVVY0MxVVVlU0gzRVo0YjJQaUFTdmhKNDl0TDhBRVFFQUFZa0NQQVFZQVFvQUpoWWhCRDFFYUlXZQogICAgICAgIEJ0REc3bFJkSTJGdzBOdjY5dW55QlFKblplSHdBaHNNQlFrRHdtY0FBQW9KRUdGdzBOdjY5dW55Y1NBUC8yZ3IKICAgICAgICBFMUdlVXhGNmVyQUxpd2E4c1djQVV5YXlaMTBCa0VxLzVZay9VSUZQODd4WEJTdnJQdERPQnFWbjErVkxFSm9PCiAgICAgICAgM1ZzNEU5SGVmZFUrWmRwTEY5bUkrZy9hZlNwdi9lbFduczdmL3IwK0IzS0RYVE8reExBaS9hUlVVTmZlcVdCTQogICAgICAgIFVscXQ5ZXJGZXJOUUNPNm4zTE02N3NYMkhNQ205TlJXT2J5NXF2dU1sZlhhNG11NERRbjR6c2VoUWw0NENWaFYKICAgICAgICBIMllnWXZ0MzJNcmRFVmZVN2w1dmlWMWtTc1FFRC83ZCs3WTIwMTZYdDN5RWFMbVFITGM1ejRhZjA1Vyt6N3N4CiAgICAgICAgcE5MNk52WXgrd2NQdmxKZ0R3V1lzbzhMZFZ2NEY0ZG9xYURXOTFyMHJXUnd6d0w0bGwvTmJOWG9GRjlTWm0rMwogICAgICAgIENMVXJ5a1NvRHNmUDAzSHh2bWxqMGQwZ2g2TVhwSGVldjk3eXBBNzgxREd1cTg4VkpYUXNZa0JSOUxBWlh4VFoKICAgICAgICB1eDBWd1FTdXJYbUFKaDdrUlppV1U4cURlcXFXNGVNTktKL3BQZVRreE5lSkdHNzNrZlUvQWo5eDg2U2pEazZtCiAgICAgICAgSE40dlBKWmhQcExZL2ROZFhsT0dVMWE0eG53MXYyT2xuRkY0bmp0V2g3SzlSQk4ybUdidjVabDQvTDVMa2RjVgogICAgICAgIEh6cU0rd0VwbEpLamFFd3BQQjIyZDdKZjZtZ004bHF4VWx2TnRSSmlnMEtoeGJkQnpQdTF2K041cTRWR2NKZVgKICAgICAgICBKRHhYd3pUZTRGYXRpcU9jTTBZTmFuTlYvcElVNU1SUlpiYVVlUnM4Z0hxUlc5eGNXVTlZYXh2UllaUklvc0l4CiAgICAgICAgRHpjWHVGMGcxS01sY3hyWTRoanJ1Q0lnazJsMytZWktHODJXRVdhegogICAgICAgID11cGxRCiAgICAgICAgLS0tLS1FTkQgUEdQIFBVQkxJQyBLRVkgQkxPQ0stLS0tLQogICAgICAic291cmNlIjogImRlYiBbc2lnbmVkLWJ5PSRLRVlfRklMRV0gaHR0cHM6Ly9yZWxlYXNlLW9yYWN1bGFyLmluZnJhaG91c2UuY29tLwogICAgICAgICRSRUxFQVNFIG1haW4iCiJwYWNrYWdlX3VwZGF0ZSI6IHRydWUKInBhY2thZ2VzIjoKLSAibWFrZSIKLSAiZ2NjIgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJydWJ5LXJ1YnlnZW1zIgotICJydWJ5LWRldiIKLSAiZGViaGVscGVyIgotICJkZXZzY3JpcHRzIgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgotICJnb2xhbmciCi0gImh1Z28iCi0gIm5vZGVqcyIKLSAibnBtIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInJ1bmNtZCI6Ci0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwganNvbiIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLWNvcmUiCi0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwgYXdzLXNkay1zZWNyZXRzbWFuYWdlciIKLSAiaWgtcHVwcGV0ICAtLWVudmlyb25tZW50IGRldmVsb3BtZW50IC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbAogIC0tbW9kdWxlLXBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlcwogIGFwcGx5IC9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwIgotICJpaC1hd3MgLS12ZXJib3NlIGF1dG9zY2FsaW5nIGNvbXBsZXRlIGJvb3RzdHJhcCIKIndyaXRlX2ZpbGVzIjoKLSAiY29udGVudCI6ICJleHBvcnQgQVdTX0RFRkFVTFRfUkVHSU9OPXVzLXdlc3QtMSIKICAicGF0aCI6ICIvZXRjL3Byb2ZpbGUuZC9hd3Muc2giCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogImRldmVsb3BtZW50IgogICAgInB1cHBldF9yb2xlIjogImdoYV9ydW5uZXIiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImloLXB1cHBldFwiOntcImNhbmNlbF9pbnN0YW5jZV9yZWZyZXNoX29uX2Vycm9yXCI6ZmFsc2UsXCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L2hpZXJhLnlhbWxcIixcIm1hbmlmZXN0XCI6XCIvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9tYW5pZmVzdHMvc2l0ZS5wcFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzL3tlbnZpcm9ubWVudH0vbW9kdWxlczp7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXNcIixcInJvb3QtZGlyZWN0b3J5XCI6XCIvb3B0L3B1cHBldC1jb2RlXCJ9fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvaWgtcHVwcGV0Lmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiYm9vdHN0cmFwX2hvb2tuYW1lXCI6XCJib290c3RyYXBcIixcImxhYmVsc1wiOltcImF3c19yZWdpb246dXMtd2VzdC0xXCIsXCJhd3NfYWNjb3VudDozMDM0Njc2MDI4MDdcIixcImluc3RhbGxhdGlvbl9pZDpmNDVjMDI1My03ODEwLTEyZjgtOWY0MC0zZThlM2Q5ZDZmYTVcIixcIm9yYWN1bGFyXCIsXCJodWdvXCJdLFwicmVnaXN0cmF0aW9uX3Rva2VuX3NlY3JldF9wcmVmaXhcIjpcIkdILXJlZy10b2tlbi1JOTJLWkVcIn0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfAogICAgZ2xvYmFsIDogewogICAgICAgICAgICBleHRlcm5hbC1kaXIgOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kLyIsCiAgICB9CiAgInBhdGgiOiAiL2V0Yy9mYWN0ZXIvZmFjdGVyLmNvbmYiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHZGw0ZkFCRUFDc2E1ZnhWWDRWZU1XaEZRakdKQ01JNjF1d1BaWTlUbktKNHYza3IrMDVXSnZlcERxVgogICAgICAgIGpqWUxlSlEycHowVnBQajFvTnpEaWRNUUNxRW1vbzZuNlNtMEJ0eDl2UkNUa29pd3JteGhRM2ptTEwwK0VyeVMKICAgICAgICB5Qy9rakZQN2VhWjgzQXl6cG1VYyt1ZkcvUVN4RjBUYXJnUCtDU2tBNEFZSXMrREJwVkdiT1FJNFpSampsWHN6CiAgICAgICAgcTFMa2Q0NE9oZlk0RUcyaFBwTGNsblJ1YkJFYzB1OWRNRERuNFJidGpydTdscnkzUm9ML1gwTjM5RjA3SVlYOQogICAgICAgIEZ6c1gvYVdkVlcwTkdFRnBsM3ZjSmt3cTBuQ3dZTE1UT2tpNXMrYW1xVVhmeWQrdUNUYzQ0LzBOU0d5OW9iclQKICAgICAgICBHQU95STVzcE9VU2FncG55WTFiK3Y4UVF5VExsMzJsUWt5aWZMQUtneEo0UjJZM1d3UDZLTjljYnlGQXBCeEtHCiAgICAgICAgNFpwdXU5TGpwVVdpeStzb0tGM242T1R1RW1GMUpQaXRNNHV0Z2l3a2l1cTF4SFlMWGsvcEpEMGVOS0xUanJMMgogICAgICAgIDg2VVJYc0prT00vSVpydm82dXZ1MkFMVjhvMm1qbUlyajd2UzArUzZEZ2hGcEZGOU5YVjQrY3lXelJnV2hkQzcKICAgICAgICBCWnluTnRIb2c0M2RRQnNSaXVUWkJDV0lvUWtjUU5FeTVHT24vRHdqSWdJT21aSy9UaW9nNzU5NkFxaDVlS001CiAgICAgICAgU2F0ekJDUVNVenNFYVl4YlEwNU9OMkdxMzBOd1ludHlHdDZNamdjcWNlanprWlBHSzR6WFpSL2p3N1dQQTNHKwogICAgICAgIElQRzlNRTM3Y3BZNGk1Q2ZxcVYzbmpjeXJIY01TSW03aExWZVZxQU5vb1J1NjlXYk1CRjRrQVhuV1FBUkFRQUIKICAgICAgICB0R05KYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRTl5CiAgICAgICAgWVdOMWJHRnlJSEpsY0c5emFYUnZjbmtwSUR4d1lXTnJZV2RsY2kxdmNtRmpkV3hoY2tCcGJtWnlZV2h2ZFhObAogICAgICAgIExtTnZiVDZKQWxjRUV3RUtBRUVXSVFROVJHaUZuZ2JReHU1VVhTTmhjTkRiK3ZicDhnVUNaMlhoOEFJYkF3VUoKICAgICAgICBBOEpuQUFVTENRZ0hBZ0lpQWdZVkNna0lDd0lFRmdJREFRSWVCd0lYZ0FBS0NSQmhjTkRiK3ZicDhtbGVELzBkCiAgICAgICAgdjZDeklqMHJVeW1YUjZoQjVNWWlFSCtBbG1jcEVITyswQ3dvU3lGQzRlN3dkczFJcTBUVW9jTXl6WWxVUjhzQgogICAgICAgIGEreTJLTUd2bE5aQmVuSUtvcjAwNit6ZXdET21aWmJzOEt6YXZHQy9kTDlybU9uSTNiK1lkamFoUC95dm9rcHMKICAgICAgICAwM0kzSHNPRjlJaE9LdjZTbWczZ0QrSzFnRFUxVlFTWGRjZ2l5WDMyZFNaaG45WVJnUzhCcDUxSERNNHZzZmEzCiAgICAgICAgb2hvN0FLT3V5ZWx5V1VpNml5ZTF2L3d3Vjg5dE8rZkhSZzBGZUdBNWc4WnRYRFcyOUNPUDRnZy94OVhiRlVpNgogICAgICAgIEdGeUs2RVlGdm5zZHp2elRWN0pYeHRnMStQa2xveEpWRFJBZm5PUUdCTlh4TGRjM05jaTIwd09Ia2NHZEZJNnMKICAgICAgICBXN0tIMFZhOXh3c1QreHlRQTY1dm0xS1l6R0ordHN5ZTE5M1o0enZpM0pFbklkNFpZVU1aWEM2cTlnZWFLRktsCiAgICAgICAgRGx6dEZWWDUyUENHeGs1MlloSlB3WWNiOEpFRzNweE80eHdtRU9rOVRwTnRsVk1DZVgzZWFGYk5SVDJwWXJYYQogICAgICAgIEREL2ZCT2ZPRis1S3MxM0RBL3pKbnFwSHprbVNuNWdLOFdvR3U3UXUxZnpLNzJMY1RxYi82SnllSW04UlNydUUKICAgICAgICBiems2V0tYalB0eVhyczRWUStkMlhyOHk4Yk5nR3JCWDNUdVlhaVR2L05ka0hlaERvcXZzb0J1czQ4OS9DVVlaCiAgICAgICAgbU52MEt6c3pINWx6UHl2aTlyaURVUVJFZjNpcXhsLzVZMmFhTStWZHhoWGVmN3pJbzhpdDllcnZVMU5qaExzdAogICAgICAgIGh5MG9zbGxuWEg1TnZia1NZSEw3ZEV2N0NYVlhIb0JIUjFhcHJNdzJpYmtDRFFSblplSHdBUkFBMzA4aHRvMzAKICAgICAgICBuTEwwYy83NUU5YlFSTUJFOGFVaDdzd3JiUGo0bWlXeEhsemJXZFRzVjE3UDhEUFhuSlo2ZXE4VlVqcDYyWEh5CiAgICAgICAgS3J4YksvZTVXYWZoTWVuQlhDeWcxZVNkbjduMHI5bmIwRzlOS3hRNU84NlI1cFlaVmhERElIK3pNRnI2Y3BiMwogICAgICAgIEpSOWhsaEhPV3c5bktOU3VhMFRTL2FoS25DUWV3eDJ2MmNseERPaEc5QnN4ZlArT1l5a2tUSEx2QlZGbjh4S0oKICAgICAgICBRclpidGtuUE9BZDBxYUsxampuZ1JpYUpOWHlWWkJEVkFmUFhZYU5yS09ya3FCd1RZakdIR1lHdTNZUXdwNThOCiAgICAgICAgSjM5QjFPeXQ4emM3aFFublFLd1hRZ2ZFaE9uTFpGbDhhSkRBb2pQa0JlcHduc0tQTVo5RnVrQXQ5RHBab1VYdQogICAgICAgIDVtT2QzZFEzZDFKQTRvVXZTS1Z1TWtXWnc0ZXRPbDlDbHplSnhZV3ZsRGM4eFBHc0k5QU9xZmdJYXFDWmpFOXUKICAgICAgICAvb3kzeExEcjkrbjlmNEV5YXpraXhQTWNtL29Pd3RrUmZ4WjlKYU5TVFJ5S1JwZFRPZDJ6T21nNFA5TUVabm5kCiAgICAgICAgNkozSDFENnFmYkVJYUc3SGt2RVc3YzFuTHBXMnhyTjZXWjZreTZGd1ppZDAzajlOMVg3YTV3WkpaaVQ0Z1l1dAogICAgICAgIFN6SXo0UlMyamJrWmd5NGdCV2krc0lmZDliVGtWRzcvNVNCam4wV0E5NWtJS3I1MjVXVlgrS3dtNXFrYU5IZE4KICAgICAgICBnT3FLL3BkS1gzUTNOS1hURG1CV3VPcnRoSEk1TUxHYVBLd3hDVnhaSTI3MGpvVXhQbjJmYUh5emRQNWNiTm9mCiAgICAgICAgZGlVd25XVVVVY0MxVVVlU0gzRVo0YjJQaUFTdmhKNDl0TDhBRVFFQUFZa0NQQVFZQVFvQUpoWWhCRDFFYUlXZQogICAgICAgIEJ0REc3bFJkSTJGdzBOdjY5dW55QlFKblplSHdBaHNNQlFrRHdtY0FBQW9KRUdGdzBOdjY5dW55Y1NBUC8yZ3IKICAgICAgICBFMUdlVXhGNmVyQUxpd2E4c1djQVV5YXlaMTBCa0VxLzVZay9VSUZQODd4WEJTdnJQdERPQnFWbjErVkxFSm9PCiAgICAgICAgM1ZzNEU5SGVmZFUrWmRwTEY5bUkrZy9hZlNwdi9lbFduczdmL3IwK0IzS0RYVE8reExBaS9hUlVVTmZlcVdCTQogICAgICAgIFVscXQ5ZXJGZXJOUUNPNm4zTE02N3NYMkhNQ205TlJXT2J5NXF2dU1sZlhhNG11NERRbjR6c2VoUWw0NENWaFYKICAgICAgICBIMllnWXZ0MzJNcmRFVmZVN2w1dmlWMWtTc1FFRC83ZCs3WTIwMTZYdDN5RWFMbVFITGM1ejRhZjA1Vyt6N3N4CiAgICAgICAgcE5MNk52WXgrd2NQdmxKZ0R3V1lzbzhMZFZ2NEY0ZG9xYURXOTFyMHJXUnd6d0w0bGwvTmJOWG9GRjlTWm0rMwogICAgICAgIENMVXJ5a1NvRHNmUDAzSHh2bWxqMGQwZ2g2TVhwSGVldjk3eXBBNzgxREd1cTg4VkpYUXNZa0JSOUxBWlh4VFoKICAgICAgICB1eDBWd1FTdXJYbUFKaDdrUlppV1U4cURlcXFXNGVNTktKL3BQZVRreE5lSkdHNzNrZlUvQWo5eDg2U2pEazZtCiAgICAgICAgSE40dlBKWmhQcExZL2ROZFhsT0dVMWE0eG53MXYyT2xuRkY0bmp0V2g3SzlSQk4ybUdidjVabDQvTDVMa2RjVgogICAgICAgIEh6cU0rd0VwbEpLamFFd3BQQjIyZDdKZjZtZ004bHF4VWx2TnRSSmlnMEtoeGJkQnpQdTF2K041cTRWR2NKZVgKICAgICAgICBKRHhYd3pUZTRGYXRpcU9jTTBZTmFuTlYvcElVNU1SUlpiYVVlUnM4Z0hxUlc5eGNXVTlZYXh2UllaUklvc0l4CiAgICAgICAgRHpjWHVGMGcxS01sY3hyWTRoanJ1Q0lnazJsMytZWktHODJXRVdhegogICAgICAgID11cGxRCiAgICAgICAgLS0tLS1FTkQgUEdQIFBVQkxJQyBLRVkgQkxPQ0stLS0tLQogICAgICAic291cmNlIjogImRlYiBbc2lnbmVkLWJ5PSRLRVlfRklMRV0gaHR0cHM6Ly9yZWxlYXNlLW9yYWN1bGFyLmluZnJhaG91c2UuY29tLwogICAgICAgICRSRUxFQVNFIG1haW4iCiJwYWNrYWdlX3VwZGF0ZSI6IHRydWUKInBhY2thZ2VzIjoKLSAibWFrZSIKLSAiZ2NjIgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJydWJ5LXJ1YnlnZW1zIgotICJydWJ5LWRldiIKLSAiZGViaGVscGVyIgotICJkZXZzY3JpcHRzIgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgotICJnb2xhbmciCi0gImh1Z28iCi0gIm5vZGVqcyIKLSAibnBtIgotICJnaCIKLSAibWFrZSIKLSAicHl0aG9uLWlzLXB5dGhvbjMiCiJydW5jbWQiOgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGpzb24iCi0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwgYXdzLXNkay1jb3JlIgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGF3cy1zZGstc2VjcmV0c21hbmFnZXIiCi0gImloLXB1cHBldCAgLS1lbnZpcm9ubWVudCBkZXZlbG9wbWVudCAtLWVudmlyb25tZW50cGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cwogIC0tcm9vdC1kaXJlY3RvcnkgL29wdC9wdXBwZXQtY29kZSAtLWhpZXJhLWNvbmZpZyAvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L2hpZXJhLnlhbWwKICAtLW1vZHVsZS1wYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzL3tlbnZpcm9ubWVudH0vbW9kdWxlczp7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMKICBhcHBseSAvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9tYW5pZmVzdHMvc2l0ZS5wcCIKLSAiaWgtYXdzIC0tdmVyYm9zZSBhdXRvc2NhbGluZyBjb21wbGV0ZSBib290c3RyYXAiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJkZXZlbG9wbWVudCIKICAgICJwdXBwZXRfcm9sZSI6ICJnaGFfcnVubmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJjYW5jZWxfaW5zdGFuY2VfcmVmcmVzaF9vbl9lcnJvclwiOmZhbHNlLFwiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sXCIsXCJtYW5pZmVzdFwiOlwiL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHBcIixcIm1vZHVsZS1wYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImJvb3RzdHJhcF9ob29rbmFtZVwiOlwiYm9vdHN0cmFwXCIsXCJsYWJlbHNcIjpbXCJhd3NfcmVnaW9uOnVzLXdlc3QtMVwiLFwiYXdzX2FjY291bnQ6MzAzNDY3NjAyODA3XCIsXCJpbnN0YWxsYXRpb25faWQ6ZjQ1YzAyNTMtNzgxMC0xMmY4LTlmNDAtM2U4ZTNkOWQ2ZmE1XCIsXCJvcmFjdWxhclwiLFwiaHVnb1wiXSxcInJlZ2lzdHJhdGlvbl90b2tlbl9zZWNyZXRfcHJlZml4XCI6XCJHSC1yZWctdG9rZW4tSTkyS1pFXCJ9IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9jdXN0b20uanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6IHwKICAgIGdsb2JhbCA6IHsKICAgICAgICAgICAgZXh0ZXJuYWwtZGlyIDogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC8iLAogICAgfQogICJwYXRoIjogIi9ldGMvZmFjdGVyL2ZhY3Rlci5jb25mIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="
userdata changes:
--- before
+++ after
@@ -81,6 +81,7 @@
 - "hugo"
 - "nodejs"
 - "npm"
+- "gh"
 - "make"
 - "python-is-python3"
 "runcmd":
EOF userdata changes.
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions2025050520313903850000000c"
        name             = "lambda_permissions2025050520313903850000000c"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  ~ {
                      ~ Action   = "secretsmanager:DeleteSecret" -> [
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:DeleteSecret",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_deregistration"
      ~ last_modified                  = "2025-05-19T01:15:25.000+0000" -> (known after apply)
      ~ s3_key                         = "c9dc7840-3f44-442f-52b0-a6189eb80436.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/c9dc7840-3f44-442f-52b0-a6189eb80436.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "876c0ab9cc3b9d92d9d539589c2f18e5-5" -> (known after apply)
      ~ id                            = "c9dc7840-3f44-442f-52b0-a6189eb80436.zip" -> (known after apply)
      ~ key                           = "c9dc7840-3f44-442f-52b0-a6189eb80436.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_deregistration/c9dc7840-3f44-442f-52b0-a6189eb80436.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4964276848455610458" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6538831741a0f02462174590f7abb061" -> "65382ebfb02baacf4d7960d21c459d46"
          ~ "main_version"         = "8694bd493be5ffcf3fe3e600bf01c93c" -> "1bd4f75c8ceeb5d743f6f2342abacf97"
        }
    }

  # module.actions-runner.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "c9dc7840-3f44-442f-52b0-a6189eb80436" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "8694bd493be5ffcf3fe3e600bf01c93c" -> "1bd4f75c8ceeb5d743f6f2342abacf97"
          ~ "requirements.txt" = "6538831741a0f02462174590f7abb061" -> "65382ebfb02baacf4d7960d21c459d46"
        }
      ~ result  = "c9dc7840-3f44-442f-52b0-a6189eb80436" -> (known after apply)
    }

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_record_metric"
      ~ last_modified                  = "2025-05-19T03:49:37.000+0000" -> (known after apply)
      ~ s3_key                         = "6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "6cbd77e75ff7396d3f112bf2dc69c20a" -> (known after apply)
      ~ id                            = "6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip" -> (known after apply)
      ~ key                           = "6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/record_metric/6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "1553163264374647964" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6538831741a0f02462174590f7abb061" -> "65382ebfb02baacf4d7960d21c459d46"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "6d923806-98bf-d4d6-156e-136fd3b3e8ea" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "6538831741a0f02462174590f7abb061" -> "65382ebfb02baacf4d7960d21c459d46"
            # (1 unchanged element hidden)
        }
      ~ result  = "6d923806-98bf-d4d6-156e-136fd3b3e8ea" -> (known after apply)
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_registration"
      ~ last_modified                  = "2025-05-19T01:15:25.000+0000" -> (known after apply)
      ~ s3_key                         = "0bc13933-1b66-905a-3393-feb49fba2c7e.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/0bc13933-1b66-905a-3393-feb49fba2c7e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "14ed065a65d03d6066929120ed227615-5" -> (known after apply)
      ~ id                            = "0bc13933-1b66-905a-3393-feb49fba2c7e.zip" -> (known after apply)
      ~ key                           = "0bc13933-1b66-905a-3393-feb49fba2c7e.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_registration/0bc13933-1b66-905a-3393-feb49fba2c7e.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "7006530603121529593" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "c9bc5cebad6b81307c300f8d1e09723a" -> "65382ebfb02baacf4d7960d21c459d46"
          ~ "main_version"         = "f9ec518ccebbfddf2a90c8883410c99b" -> "daed8b359d82cc0754c16ab3a3fe1770"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "0bc13933-1b66-905a-3393-feb49fba2c7e" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "f9ec518ccebbfddf2a90c8883410c99b" -> "daed8b359d82cc0754c16ab3a3fe1770"
          ~ "requirements.txt" = "c9bc5cebad6b81307c300f8d1e09723a" -> "65382ebfb02baacf4d7960d21c459d46"
        }
      ~ result  = "0bc13933-1b66-905a-3393-feb49fba2c7e" -> (known after apply)
    }

Plan: 9 to add, 7 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDksICJjaGFuZ2UiOiA3LCAiZGVzdHJveSI6IDl9fQ==
```
</details>